const express = require('express');
const cors=require("cors");

const app = express();

const mainRoute = require('./routes/main.route');

app.use('/api', mainRoute);

const PORT = 3000;


app.listen(PORT);

// !!
// Зробити запити на 3 різних валюти.
// Запит адміна до сервера на відсилання emails має бути з ключем.
// Адмін має вказувати курс яких валют надсилати.
// Зробити кешування курсу у кожного провайдера курсу криптовалюти на 5 хв.
// закинути код на github
// TODO: Захостити веб сторінку на git Pages
// Закинути проект на хостинг.
// !!


// View
// TODO: Зробити «онлайн кабінет» з реєстрацією та відображенням курсом валют, налаштуванням підписок на розсилку.
// TODO: Онлайн кабінет адміна має мати відповідні до аміна можливості.


// Additional
// TODO: ADDITIONAL Зробити логування в файл.
// TODO: ADDITIONAL Додаток має бути покритий тестами
